In [1]:
!pip install kaggle

Collecting kaggle
  Downloading kaggle-1.8.3-py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: black>=24.10.0 in c:\programdata\anaconda3\lib\site-packages (from kaggle) (24.10.0)
Requirement already satisfied: bleach in c:\programdata\anaconda3\lib\site-packages (from kaggle) (6.2.0)
Collecting kagglesdk<1.0,>=0.1.14 (from kaggle)
  Downloading kagglesdk-0.1.14-py3-none-any.whl.metadata (13 kB)
Collecting mypy>=1.15.0 (from kaggle)
  Downloading mypy-1.19.1-cp313-cp313-win_amd64.whl.metadata (2.3 kB)
Requirement already satisfied: packaging in c:\programdata\anaconda3\lib\site-packages (from kaggle) (24.2)
Requirement already satisfied: protobuf in c:\programdata\anaconda3\lib\site-packages (from kaggle) (5.29.3)
Requirement already satisfied: python-dateutil in c:\programdata\anaconda3\lib\site-packages (from kaggle) (2.9.0.post0)
Requirement already satisfied: python-slugify in c:\programdata\anaconda3\lib\site-packages (from kaggle) (5.0.2)
Requirement already satisfied: requests in c:\programdata\anaconda3\lib\site-packages (from kaggle) (2.32.3)
Requirement already satisfied: six>=1.10 in c:\programdata\anaconda3\lib\site-packages (from kaggle) (1.17.0)
Requirement already satisfied: tqdm in c:\programdata\anaconda3\lib\site-packages (from kaggle) (4.67.1)
Collecting types-requests (from kaggle)
  Downloading types_requests-2.32.4.20250913-py3-none-any.whl.metadata (2.0 kB)
Collecting types-tqdm (from kaggle)
  Downloading types_tqdm-4.67.0.20250809-py3-none-any.whl.metadata (1.7 kB)
Requirement already satisfied: urllib3>=1.15.1 in c:\programdata\anaconda3\lib\site-packages (from kaggle) (2.5.0)
Requirement already satisfied: click>=8.0.0 in c:\programdata\anaconda3\lib\site-packages (from black>=24.10.0->kaggle) (8.1.8)
Requirement already satisfied: mypy-extensions>=0.4.3 in c:\programdata\anaconda3\lib\site-packages (from black>=24.10.0->kaggle) (1.0.0)
Requirement already satisfied: pathspec>=0.9.0 in c:\programdata\anaconda3\lib\site-packages (from black>=24.10.0->kaggle) (0.10.3)
Requirement already satisfied: platformdirs>=2 in c:\programdata\anaconda3\lib\site-packages (from black>=24.10.0->kaggle) (4.3.7)
Requirement already satisfied: colorama in c:\programdata\anaconda3\lib\site-packages (from click>=8.0.0->black>=24.10.0->kaggle) (0.4.6)
Requirement already satisfied: typing_extensions>=4.6.0 in c:\programdata\anaconda3\lib\site-packages (from mypy>=1.15.0->kaggle) (4.15.0)
Collecting librt>=0.6.2 (from mypy>=1.15.0->kaggle)
  Downloading librt-0.7.7-cp313-cp313-win_amd64.whl.metadata (1.4 kB)
Requirement already satisfied: webencodings in c:\programdata\anaconda3\lib\site-packages (from bleach->kaggle) (0.5.1)
Requirement already satisfied: text-unidecode>=1.3 in c:\programdata\anaconda3\lib\site-packages (from python-slugify->kaggle) (1.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\programdata\anaconda3\lib\site-packages (from requests->kaggle) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in c:\programdata\anaconda3\lib\site-packages (from requests->kaggle) (3.7)
Requirement already satisfied: certifi>=2017.4.17 in c:\programdata\anaconda3\lib\site-packages (from requests->kaggle) (2025.10.5)
Downloading kaggle-1.8.3-py3-none-any.whl (102 kB)
Downloading kagglesdk-0.1.14-py3-none-any.whl (159 kB)
Downloading mypy-1.19.1-cp313-cp313-win_amd64.whl (10.1 MB)
   ---------------------------------------- 0.0/10.1 MB ? eta -:--:--
   ------------------------------ --------- 7.6/10.1 MB 36.8 MB/s eta 0:00:01
   ---------------------------------------- 10.1/10.1 MB 32.5 MB/s eta 0:00:00
Downloading librt-0.7.7-cp313-cp313-win_amd64.whl (49 kB)
Downloading types_requests-2.32.4.20250913-py3-none-any.whl (20 kB)
Downloading types_tqdm-4.67.0.20250809-py3-none-any.whl (24 kB)
Installing collected packages: types-requests, librt, types-tqdm, mypy, kagglesdk, kaggle

  Attempting uninstall: mypy

    Found existing installation: mypy 1.14.1

   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
    Uninstalling mypy-1.14.1:
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
      Successfully uninstalled mypy-1.14.1
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------- ------------------- 3/6 [mypy]
   -------------------------- ------------- 4/6 [kagglesdk]
   -------------------------- ------------- 4/6 [kagglesdk]
   ---------------------------------------- 6/6 [kaggle]

Successfully installed kaggle-1.8.3 kagglesdk-0.1.14 librt-0.7.7 mypy-1.19.1 types-requests-2.32.4.20250913 types-tqdm-4.67.0.20250809

In [2]:
import os
os.environ["KAGGLE_API_TOKEN"] = "KGAT_f681d66ea7c32ee2121c080301e76784"

In [3]:
!kaggle competitions list

ref                                                                              deadline             category          reward  teamCount  userHasEntered
-------------------------------------------------------------------------------  -------------------  ---------  -------------  ---------  --------------
https://www.kaggle.com/competitions/ai-mathematical-olympiad-progress-prize-3    2026-04-15 23:59:00  Featured   2,207,152 Usd       1200           False
https://www.kaggle.com/competitions/passenger-screening-algorithm-challenge      2017-12-15 23:59:00  Featured   1,500,000 Usd        518           False
https://www.kaggle.com/competitions/zillow-prize-1                               2018-01-10 15:59:00  Featured   1,200,000 Usd       3770           False
https://www.kaggle.com/competitions/data-science-bowl-2017                       2017-04-12 23:59:00  Featured   1,000,000 Usd       1972           False
https://www.kaggle.com/competitions/vesuvius-challenge-ink-detection             2023-06-14 23:59:00  Featured   1,000,000 Usd       1249           False
https://www.kaggle.com/competitions/gemini-3                                     2025-12-12 23:59:00  Featured     500,000 Usd       4102           False
https://www.kaggle.com/competitions/openai-gpt-oss-20b-red-teaming               2025-08-26 23:59:00  Featured     500,000 Usd        606           False
https://www.kaggle.com/competitions/openai-to-z-challenge                        2025-06-29 23:59:00  Featured     500,000 Usd        226           False
https://www.kaggle.com/competitions/llm-prompt-recovery                          2024-04-16 23:59:00  Featured     200,000 Usd       2175           False
https://www.kaggle.com/competitions/asl-fingerspelling                           2023-08-24 23:59:00  Research     200,000 Usd       1314           False
https://www.kaggle.com/competitions/vesuvius-challenge-surface-detection         2026-02-13 23:59:00  Research     200,000 Usd        564           False
https://www.kaggle.com/competitions/second-annual-data-science-bowl              2016-03-14 23:59:00  Featured     200,000 Usd        192           False
https://www.kaggle.com/competitions/datasciencebowl                              2015-03-16 23:59:00  Featured     175,000 Usd       1049           False
https://www.kaggle.com/competitions/data-science-bowl-2019                       2020-01-22 23:59:00  Featured     160,000 Usd       3493           False
https://www.kaggle.com/competitions/feedback-prize-2021                          2022-03-15 23:59:00  Featured     160,000 Usd       2058           False
https://www.kaggle.com/competitions/the-nature-conservancy-fisheries-monitoring  2017-04-12 23:59:00  Featured     150,000 Usd       2293           False
https://www.kaggle.com/competitions/tensorflow-great-barrier-reef                2022-02-14 23:59:00  Research     150,000 Usd       2025           False
https://www.kaggle.com/competitions/AI4Code                                      2022-11-10 23:59:00  Featured     150,000 Usd       1135           False
https://www.kaggle.com/competitions/google-gemma-3n-hackathon                    2025-08-06 23:59:00  Featured     150,000 Usd        606           False
https://www.kaggle.com/competitions/gemma-language-tuning                        2025-01-15 00:59:00  Analytics    150,000 Usd          0           False

In [4]:
!kaggle competitions download -c titanic

Downloading titanic.zip to C:\Users\Admin\python-study

  0%|          | 0.00/34.1k [00:00<?, ?B/s]
100%|##########| 34.1k/34.1k [00:00<00:00, 62.2MB/s]

In [5]:
# 문제정의.인식
# 가설설정.검증
# 데이터 수집 (크롤링, 리서치 등)
# EDA = Explonary Data Analysis
# Feature Engineering
# Hyper Parameter
# Cross Validation
# Score
# M/L Model 1 + Model 2 + Model 3 => Voting => 최종

In [6]:
import pandas as pd

train = pd.read_csv("titanic/train.csv")
test = pd.read_csv("titanic/test.csv")

In [8]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [10]:
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [11]:
train.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
train.shape

(891, 12)

In [13]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [14]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [15]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [17]:
# 최소값, 최대값, 중간값, 사분위값, 분산(표준편차) -> 이상치 값

In [18]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200